"use strict";
module.exports = {
    islogin: true,
    sms: new Array(),
    read_flag: false,
    message: {
        msg1: '此微信号已绑定此京东id:',
        msg2: '绑定成功，此微信号绑定的京东id:',
        msg3: '跳过',
        menu: '========青龙指令========\n' +
            '查询\n' +
            '短信登录\n' +
            'ck登录\n' +
            '========联通指令========\n' +
            '查询流量\n' +
            '联通登录\n' +
            '联通密码登录\n' +
            '联通#关闭监控#手机号\n' +
            '联通#开启监控#手机号\n' +
            '联通#设置阈值+值#手机号\n' +
            'Ps: 1、上面指令中阈值单位为M,但不用带单位,默认为10M 例如：联通#阈值5#156xxxxxxxx\n' +
            '=======================',
        menu2: '========管理员=========\n' +
            '初始化青龙\n' +
            '======================='
    }
};
