"use strict";
module.exports = {
    islogin: true,
    sms: new Array(),
    read_flag: false,
    message: {
        msg1: '此微信号已绑定此京东id:',
        msg2: '绑定成功，此微信号绑定的京东id:',
        msg3: '跳过',
        menu: '========BOT指令========\n' +
            '========青龙指令========\n' +
            '查询资产\n' +
            '京东登录\n' +
            '========联通指令========\n' +
            '查询流量\n' +
            '联通登录\n' +
            '监控设置\n' +
            '=======================',
        menu2: '========管理员=========\n' +
            '初始化青龙\n' +
            '======================='
    }
};
