"use strict";
module.exports = {
    //=======================================必填===================================================
    PORT: 3000,//服务端口
    token: '',//自定义(英文字母加数字)请求机器人的api接口token(后面一对一通知会用到，查询资产和添加/更新CK 用不到)
    QLurl: '',//青龙url  http://IP:端口

    //青龙面板=>系统设置=>应用设置 最少权限:环境变量;后续更新可能会用到:配置文件、脚本管理、定时任务
    clientId: '', 
    clientSecret: '',

    //=======================================选填===================================================
    //管理员功能(暂时没有功能)
    admin: {
        isTrue: false,//是否开启
        name: '',//管理员微信昵称
    },
    //系统消息推送，例如：微信登录、退出; 
    pushMessage: {
        choice: 0,//0：不推送 1：Server酱无aqq推送 2：pluspush推送
        pushList: [
            {
                id: 1,
                pushKey: '',//Server酱无aqq推送（暂时只支持ios）
                url: 'https://pushdeer.ftqq.com/message/push'
            }, {
                id: 2,
                pushKey: '',//pluspush推送
                url: 'http://pushplus.hxtrip.com/send'
            }
        ]
    },

    //==========================================================================================
    message: {
        menu: '========使用步骤========\n' +
            '1、查看京东id(发送 查看京东id)\n' +
            '2、绑定京东id(发送 绑定:第一步得到的京东id)\n' +
            '========其他菜单========\n' +
            '查看绑定(查看绑定的京东id)\n' +
            '解绑京东id(发送 解绑:绑定的京东id)\n' +
            '添加/更新CK(直接发送CK)\n' +
            '查询资产(发送 查询资产)\n' +
            '短信登录(待开发)\n' +
            '========注意事项========\n' +
            '京东id一般以"jd-"或"jd_"开头\n'+
            '========Bot========\n'
        ,
        bindId: '绑定成功，你绑定的京东id:',
        seeId: '打开 京东app => 我的 => 右上角设置图标 => 用户名:jd=xxx => 发送 绑定:jd-xxx 给我',
        msg1: '你目前没有绑定京东id!',
        msg2: '解绑成功\n发送 查看绑定 查看绑定的京东id',
        msg3: '你已绑定此京东id:',
        msg4: '你目前已绑定:',
        msg5: '你目前没有绑定此京东id!',
        msg6: '没有匹配到你发的消息,请检查消息,可以发送 菜单 查看详情',
        msg7: 'cookie格式错误',
        msg8: 'cookie添加成功,正在绑定京东id...',
        msg9: 'cookie添加失败',
        msg10: 'cookie更新成功,正在绑定京东id...',
        msg11: 'cookie更新失败',
        msg12:'cookie已启用',
        msg13:'cookie被禁用，启用中...',
        msg14:'cookie启用失败',
        msg15:'添加cookie,请稍后...',
        msg16:'更新cookie,请稍后...',
        msg17:'查询中，请稍后...',
        msg18:'你所绑定的京东id没有匹配到cookie',

    }
}